# YOLO12-L P2 Head + Deep A2C2f Combined Ablation Variant
# ========================================================
# Combines Variant 1 (P2 Head) + Variant 2 (Deep A2C2f) into one model.
#
# Modifications:
#   1) P2 detection head at stride 4 (4 detection scales instead of 3)
#   2) A2C2f backbone repeats increased from 4 to 6 (deeper attention)
#
# Hypothesis: P2 alone improved results (+0.56% mAP50). Deep A2C2f alone
# did not help. But deeper attention may feed better features into the P2
# head specifically, making the combination stronger than P2 alone.
#
# Base: yolo12.yaml (L scale: depth=1.00, width=1.00, max_channels=512)

# Parameters
nc: 80 # number of classes (overridden by data.yaml at training time)
scales:
  l: [1.00, 1.00, 512]

# YOLO12 Backbone (Deep A2C2f — same as Variant 2)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 (P2 features - used by P2 head)
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 6, A2C2f, [512, True, 4]]        # 6  ** Deep A2C2f: 4 -> 6 repeats **
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 6, A2C2f, [1024, True, 1]]       # 8  ** Deep A2C2f: 4 -> 6 repeats **

# YOLO12 Head with P2 detection (same as Variant 1)
head:
  # === Top-down path (upsampling) ===
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 9
  - [[-1, 6], 1, Concat, [1]]                          # 10 - cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]                   # 11 (P4 fused)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 12
  - [[-1, 4], 1, Concat, [1]]                          # 13 - cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]                   # 14 (P3 fused)

  # P3 -> P2 ** P2 HEAD **
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 15
  - [[-1, 2], 1, Concat, [1]]                          # 16 - cat backbone P2
  - [-1, 2, A2C2f, [128, False, -1]]                   # 17 (P2 fused)

  # === Bottom-up path (downsampling) ===
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                         # 18
  - [[-1, 14], 1, Concat, [1]]                         # 19 - cat P3 fused
  - [-1, 2, A2C2f, [256, False, -1]]                   # 20 (P3 final)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                         # 21
  - [[-1, 11], 1, Concat, [1]]                         # 22 - cat P4 fused
  - [-1, 2, A2C2f, [512, False, -1]]                   # 23 (P4 final)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                         # 24
  - [[-1, 8], 1, Concat, [1]]                          # 25 - cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                        # 26 (P5 final)

  # Detect on 4 scales: P2/4, P3/8, P4/16, P5/32
  - [[17, 20, 23, 26], 1, Detect, [nc]]                # 27 - 4 detection heads
