# YOLO12-L Deep A2C2f Ablation Variant
# =====================================
# Modification: A2C2f repeat count in backbone increased from 4 to 6
# Purpose: Test whether deeper cross-channel attention improves texture-based
#          defect detection on SVRDD dataset (7 damage classes).
#
# Base: yolo12.yaml (L scale: depth=1.00, width=1.00, max_channels=512)
# Changes:
#   - Backbone layer 6: A2C2f repeats 4 -> 6 (P4 feature extraction)
#   - Backbone layer 8: A2C2f repeats 4 -> 6 (P5 feature extraction)
#
# Original YOLO12-L: 488 layers, 26.45M params, 89.7 GFLOPs
# This variant:      ~552 layers, ~30M params, ~100 GFLOPs (estimated)

# Parameters
nc: 80 # number of classes (overridden by data.yaml at training time)
scales:
  l: [1.00, 1.00, 512]

# YOLO12 Backbone (Deep A2C2f variant)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 6, A2C2f, [512, True, 4]]        # 6  ** CHANGED: 4 -> 6 repeats **
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 6, A2C2f, [1024, True, 1]]       # 8  ** CHANGED: 4 -> 6 repeats **

# YOLO12 Head (unchanged from standard YOLO12)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]             # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]      # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]             # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]      # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]            # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]      # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]             # cat head P5
  - [-1, 2, C3k2, [1024, True]]           # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]       # Detect(P3, P4, P5)
