# YOLO12-L P2 Head + Wider Neck Combined Ablation Variant
# =========================================================
# Modification: Combines Variant 2 (P2 Head) + Variant 4 (Wider Neck)
# Purpose: Test whether adding a 4th detection head at stride 4 AND widening
#          the FPN fusion channels produces complementary gains on SVRDD.
#
# Base: yolo12.yaml (L scale)
# Changes:
#   1. P2 detection head added (from Variant 2):
#      - Extended top-down path: P3 -> P2 (upsample + concat + A2C2f)
#      - Extended bottom-up path: P2 -> P3 (conv stride 2 + concat + A2C2f)
#      - Detection heads: P2/4, P3/8, P4/16, P5/32 (was P3, P4, P5)
#   2. Wider Neck channels (from Variant 4):
#      - Top-down P4 fusion: 512 -> 768 channels
#      - Top-down P3 fusion: 256 -> 384 channels
#      - Top-down P2 fusion: 128 -> 192 channels (new P2 stage, also widened)
#      - Bottom-up P2->P3: 256 -> 384 channels
#      - Bottom-up P3->P4: 512 -> 768 channels
#   3. Backbone: UNCHANGED (same as baseline)
#
# Original YOLO12-L: 488 layers, 26.45M params, 89.7 GFLOPs, 3 detection heads
# This variant:      ~690 layers, ~37M params, ~140 GFLOPs, 4 detection heads (estimated)

# Parameters
nc: 80 # number of classes (overridden by data.yaml at training time)
scales:
  l: [1.00, 1.00, 768]  # max_channels raised from 512 to 768 (required for widening)

# YOLO12 Backbone (UNCHANGED from standard YOLO12-L baseline)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 (P2 features - used by new P2 head)
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]        # 6 (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]       # 8 (P5 features)

# Combined Head: P2 Head + Wider Neck
head:
  # === Top-down path (upsampling) ===
  # P5 -> P4 (WIDER: 512 -> 768 channels)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 9
  - [[-1, 6], 1, Concat, [1]]                          # 10 - cat backbone P4
  - [-1, 2, A2C2f, [768, False, -1]]                   # 11 ** WIDER: was 512 **

  # P4 -> P3 (WIDER: 256 -> 384 channels)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 12
  - [[-1, 4], 1, Concat, [1]]                          # 13 - cat backbone P3
  - [-1, 2, A2C2f, [384, False, -1]]                   # 14 ** WIDER: was 256 **

  # P3 -> P2 ** NEW from V2, also WIDER (128 -> 192) **
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 15
  - [[-1, 2], 1, Concat, [1]]                          # 16 - cat backbone P2
  - [-1, 2, A2C2f, [192, False, -1]]                   # 17 (P2 fused) ** NEW P2 output, WIDER **

  # === Bottom-up path (downsampling) ===
  # P2 -> P3 ** NEW from V2, also WIDER (256 -> 384) **
  - [-1, 1, Conv, [192, 3, 2]]                         # 18 (matches P2 output width)
  - [[-1, 14], 1, Concat, [1]]                         # 19 - cat P3 fused
  - [-1, 2, A2C2f, [384, False, -1]]                   # 20 (P3 final) ** WIDER **

  # P3 -> P4 (WIDER: 512 -> 768 channels)
  - [-1, 1, Conv, [384, 3, 2]]                         # 21 (matches P3 output width)
  - [[-1, 11], 1, Concat, [1]]                         # 22 - cat P4 fused
  - [-1, 2, A2C2f, [768, False, -1]]                   # 23 (P4 final) ** WIDER **

  # P4 -> P5
  - [-1, 1, Conv, [768, 3, 2]]                         # 24 (matches P4 output width)
  - [[-1, 8], 1, Concat, [1]]                          # 25 - cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                        # 26 (P5 final, unchanged)

  # Detect on 4 scales: P2/4, P3/8, P4/16, P5/32
  - [[17, 20, 23, 26], 1, Detect, [nc]]                # 27 ** 4 heads (from V2) **
