# YOLO12-L Wider Neck Ablation Variant
# =====================================
# Modification: Increased FPN/Neck channel widths for richer multi-scale fusion
# Purpose: Test whether wider feature fusion in the Neck improves discrimination
#          between visually similar defect classes on SVRDD dataset.
#
# Base: yolo12.yaml (L scale: depth=1.00, width=1.00, max_channels=512)
# Changes (Neck only, backbone unchanged):
#   - Top-down P4 fusion: A2C2f 512 -> 768 channels
#   - Top-down P3 fusion: A2C2f 256 -> 384 channels
#   - Bottom-up P3->P4: A2C2f 512 -> 768 channels
#   - Bottom-up P4->P5: C3k2 1024 -> 1024 (unchanged, already at max)
#   - max_channels raised to 768 to allow wider Neck layers
#
# Original YOLO12-L: 488 layers, 26.45M params, 89.7 GFLOPs
# This variant:      ~488 layers, ~35M params, ~115 GFLOPs (estimated)

# Parameters
nc: 80 # number of classes (overridden by data.yaml at training time)
scales:
  l: [1.00, 1.00, 768]  # max_channels raised from 512 to 768

# YOLO12 Backbone (unchanged from standard YOLO12-L)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]        # 6 (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]       # 8 (P5 features)

# YOLO12 Head with Wider Neck (modified FPN channel widths)
head:
  # === Top-down path (upsampling) ===
  # P5 -> P4 (wider: 512 -> 768 channels)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 9
  - [[-1, 6], 1, Concat, [1]]                          # 10 - cat backbone P4
  - [-1, 2, A2C2f, [768, False, -1]]                   # 11 ** WIDER: was 512 **

  # P4 -> P3 (wider: 256 -> 384 channels)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 12
  - [[-1, 4], 1, Concat, [1]]                          # 13 - cat backbone P3
  - [-1, 2, A2C2f, [384, False, -1]]                   # 14 ** WIDER: was 256 **

  # === Bottom-up path (downsampling) ===
  # P3 -> P4 (wider: 512 -> 768 channels)
  - [-1, 1, Conv, [384, 3, 2]]                         # 15 (matches P3 output)
  - [[-1, 11], 1, Concat, [1]]                         # 16 - cat P4 fused
  - [-1, 2, A2C2f, [768, False, -1]]                   # 17 ** WIDER: was 512 **

  # P4 -> P5
  - [-1, 1, Conv, [768, 3, 2]]                         # 18 (matches P4 output)
  - [[-1, 8], 1, Concat, [1]]                          # 19 - cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                        # 20 (P5/32-large)

  # Detect on 3 scales: P3/8, P4/16, P5/32
  - [[14, 17, 20], 1, Detect, [nc]]                    # 21
